<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Adobe Flash Player installer and extracts the embedded package, uploads to JSS.</string>
	<key>Identifier</key>
	<string>com.github.kernsb.bkerns-recipes.jss.AdobeFlashPlayerCLA</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Updates</string>
		<key>GROUP_NAME</key>
		<string>New Deploy : %DISPLAY_NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>AdobeFlashPlayerCLASmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>Core-AdobeFlashPlayer</string>
		<key>DISPLAY_NAME</key>
		<string>Adobe Flash Player</string>
		<key>TRIGGER_NAME</key>
		<string>AdobeFlashPlayer</string>
        <key>PATH</key>
        <string>/Library/Internet Plug-Ins/Flash Player.plugin</string>
		<key>POLICY_CATEGORY</key>
		<string>New Updates</string>
		<key>POLICY_TEMPLATE</key>
		<string>AdobeFlashPlayerCLAPolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Adobe Flash Player is freeware software for using content created on the Adobe Flash platform, including viewing multimedia, executing rich Internet applications, and streaming video and audio.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>AdobeFlashPlayer.png</string>
		<key>SITE_ID</key>
		<string>1</string>
		<key>SITE_NAME</key>
		<string>CLA</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.FlashPlayerExtractPackage</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pkg_path%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/AdobeFlashPlayerComponent.pkg/Payload</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/unpack/Library/PreferencePanes/Flash Player.prefPane</string>
			</dict>
			<key>Processor</key>
			<string>com.github.kernsb.bkerns-recipes.recipe.IntVerProcessor/IntVerProcessor</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>extension_attributes</key>
				<array>
					<dict>
						<key>ext_attribute_path</key>
						<string>AdobeFlashPlayerCLAExtensionAttribute.xml</string>
					</dict>
				</array>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
                <key>scripts</key>
                <array>
                    <dict>
                        <key>name</key>
                        <string>Core-AdobeFlash-EnableSilentBkgrdUpdates</string>
                        <key>template_path</key>
                        <string>AdobeFlashPlayerCLAScriptTemplate.xml</string>
                    </dict>
                </array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
