<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uploads the latest Snagit package to the JSS</string>
	<key>Identifier</key>
	<string>com.github.kernsb.bkerns-recipes.jss.TechSmithSnagitCLA</string>
	<key>Input</key>
	<dict>
		<key>SNAGIT_KEY</key>
		<string>fffe5400580043005a0046002d004b0043004e00380035002d00510039005a00430043002d00430035004c00320054002d0036004300370038004600</string>
		<key>CATEGORY</key>
		<string>Updates</string>
		<key>GROUP_NAME</key>
		<string>New Deploy : %DISPLAY_NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>TechSmithSnagitCLASmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>Core-TechSmithSnagit</string>
		<key>DISPLAY_NAME</key>
		<string>TechSmith Snagit</string>
		<key>TRIGGER_NAME</key>
		<string>TechSmithSnagit</string>
		<key>OS_REQUIREMENTS</key>
		<string>10.12.x,10.11.x,10.10.x,10.9.x</string>
		<key>OS_REQUIREMENTS</key>
		<string></string>
        <key>PATH</key>
        <string>/Applications/Snagit.app</string>
		<key>POLICY_CATEGORY</key>
		<string>New Updates</string>
		<key>POLICY_TEMPLATE</key>
		<string>TechSmithSnagitCLAPolicyTemplate.xml</string>
		<key>PROCESS_NAME</key>
		<string>Snagit</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string></string>
		<key>SELF_SERVICE_ICON</key>
		<string>TechSmith Snagit.png</string>
		<key>SITE_ID</key>
		<string>1</string>
		<key>SITE_NAME</key>
		<string>CLA</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.kernsb.pkg.TechSmithSnagit</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.kernsb.bkerns-recipes.recipe.IntVerProcessor/IntVerProcessor</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>extension_attributes</key>
				<array>
					<dict>
						<key>ext_attribute_path</key>
						<string>TechSmithSnagitCLAExtensionAttribute.xml</string>
					</dict>
				</array>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
 				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
