<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Oracle Java 8 installer uploads to JSS.</string>
	<key>Identifier</key>
	<string>com.github.kernsb.bkerns-recipes.jss.OracleJava8CLA</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Updates</string>
		<key>GROUP_NAME</key>
		<string>New Deploy : %DISPLAY_NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>OracleJava8CLASmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>Core-OracleJava8</string>
		<key>DISPLAY_NAME</key>
		<string>Oracle Java 8</string>
		<key>TRIGGER_NAME</key>
		<string>OracleJava8</string>
		<key>OS_REQUIREMENTS</key>
		<string>10.13.x,10.12.x,10.11.x,10.10.x,10.9.x,10.8.x</string>
        <key>PATH</key>
        <string>/Library/Internet Plug-Ins/JavaAppletPlugin.plugin</string>
		<key>POLICY_CATEGORY</key>
		<string>New Updates</string>
		<key>POLICY_TEMPLATE</key>
		<string>OracleJava8CLAPolicyTemplate.xml</string>
		<key>PROCESS_NAME</key>
		<string>MULTIPLE</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string></string>
		<key>SELF_SERVICE_ICON</key>
		<string>Oracle Java 8.png</string>
		<key>SITE_ID</key>
		<string>1</string>
		<key>SITE_NAME</key>
		<string>CLA</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.OracleJava8</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.kernsb.bkerns-recipes.recipe.IntVerProcessor/IntVerProcessor</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%pkg_path%</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FileMover</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>extension_attributes</key>
				<array>
					<dict>
						<key>ext_attribute_path</key>
						<string>OracleJava8CLAExtensionAttribute.xml</string>
					</dict>
				</array>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
                <key>scripts</key>
                <array>
                    <dict>
                        <key>name</key>
                        <string>Core-OracleJava-DisableUpdates</string>
                        <key>template_path</key>
                        <string>OracleJava8CLAScriptTemplate.xml</string>
                    </dict>
                </array>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
