<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Microsoft Skype for Business installer uploads to JSS.</string>
	<key>Identifier</key>
	<string>com.github.kernsb.bkerns-recipes.jss.MicrosoftSkypeforBusinessCLA</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Updates</string>
		<key>GROUP_NAME</key>
		<string>New Deploy : %DISPLAY_NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>MicrosoftSkypeforBusinessCLASmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>Core-MicrosoftSkypeForBusiness</string>
		<key>DISPLAY_NAME</key>
		<string>Microsoft Skype for Business</string>
		<key>TRIGGER_NAME</key>
		<string>MicrosoftSkypeforBusiness</string>
		<key>OS_REQUIREMENTS</key>
		<string></string>
        <key>PATH</key>
        <string>/Applications/Skype for Business.app</string>
		<key>POLICY_CATEGORY</key>
		<string>New Updates</string>
		<key>POLICY_TEMPLATE</key>
		<string>MicrosoftSkypeforBusinessCLAPolicyTemplate.xml</string>
		<key>PROCESS_NAME</key>
		<string>Skype for Business</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Skype for Business lets you collaborate with anyone, anywhere, on any device, with the security and control of Microsoft.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>MicrosoftSkypeforBusiness.png</string>
		<key>SITE_ID</key>
		<string>1</string>
		<key>SITE_NAME</key>
		<string>CLA</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.SkypeForBusiness</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.kernsb.bkerns-recipes.recipe.IntVerProcessor/IntVerProcessor</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>extension_attributes</key>
				<array>
					<dict>
						<key>ext_attribute_path</key>
						<string>MicrosoftSkypeforBusinessCLAExtensionAttribute.xml</string>
					</dict>
				</array>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>os_requirements</key>
				<string>%OS_REQUIREMENTS%</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%filename%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
