<policy>
    <general>
        <site>
            <id>%SITE_ID%</id>
            <name>%SITE_NAME%</name>
        </site>
        <name>CLA : New Update : %DISPLAY_NAME% %VERSION%</name>
        <enabled>false</enabled>
        <trigger>CHECKIN</trigger>
        <trigger_checkin>true</trigger_checkin>
        <trigger_other>%SITE_NAME%Update%TRIGGER_NAME%</trigger_other>
        <frequency>Ongoing</frequency>
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
    	<date_time_limitations>
      		<activation_date/>
      		<activation_date_epoch>0</activation_date_epoch>
      		<activation_date_utc/>
      		<expiration_date/>
      		<expiration_date_epoch>0</expiration_date_epoch>
      		<expiration_date_utc/>
      		<no_execute_on/>
      		<no_execute_start>6:00 AM</no_execute_start>
      		<no_execute_end>11:59 PM</no_execute_end>
    	</date_time_limitations>
		<network_limitations>
			<minimum_network_connection>No Minimum</minimum_network_connection>
			<any_ip_address>true</any_ip_address>
			<network_segments/>
		</network_limitations>
		<override_default_settings>
			<target_drive>default</target_drive>
			<distribution_point/>
			<force_afp_smb>false</force_afp_smb>
			<sus>default</sus>
			<netboot_server>current</netboot_server>
		</override_default_settings>
    	<network_requirements>Any</network_requirements>
    </general>
    <scope>
        <!--Scope added by JSSImporter-->
    	<exclusions>
      		<computers/>
      		<computer_groups>
        		<computer_group>
          			<id>1621</id>
          			<name>CLA : Collection : OS &lt; 10.11</name>
        		</computer_group>
      		</computer_groups>
      		<buildings/>
      		<departments/>
      		<users/>
      		<user_groups/>
      		<network_segments/>
      		<ibeacons/>
    	</exclusions>
    </scope>
    <package_configuration>
        <!--Package added by JSSImporter-->
    </package_configuration>
    <scripts>
        <!--Scripts added by JSSImporter-->
    	<script>
      		<id>196</id>
      		<name>Core-OS-KillProcess</name>
      		<priority>Before</priority>
      		<parameter4>%PROCESS_NAME%</parameter4>
      		<parameter5/>
      		<parameter6/>
      		<parameter7/>
      		<parameter8/>
      		<parameter9/>
      		<parameter10/>
      		<parameter11/>
    	</script>
    </scripts>
    <self_service>
        <!--Icons added by JSSImporter-->
        <use_for_self_service>false</use_for_self_service>
        <install_button_text>Install</install_button_text>
        <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
    </self_service>
    <maintenance>
        <recon>true</recon>
    </maintenance>
</policy>
