<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Microsoft//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uploads the latest OneDrive package, created with repackage, to the JSS</string>
	<key>Identifier</key>
	<string>com.github.kernsb.bkerns-recipes.jss.MicrosoftOneDriveBizCLA</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Updates</string>
		<key>GROUP_NAME</key>
		<string>New Deploy : %DISPLAY_NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>MicrosoftOneDriveBizCLASmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>Core-MicrosoftOneDriveBiz</string>
		<key>DISPLAY_NAME</key>
		<string>Microsoft OneDrive for Business</string>
		<key>TRIGGER_NAME</key>
		<string>MicrosoftOneDriveBiz</string>
        <key>PATH</key>
        <string>/Applications/OneDrive.app</string>
		<key>OS_REQUIREMENTS</key>
		<string></string>
		<key>POLICY_CATEGORY</key>
		<string>New Updates</string>
		<key>POLICY_TEMPLATE</key>
		<string>MicrosoftOneDriveBizCLAPolicyTemplate.xml</string>
		<key>PROCESS_NAME</key>
		<string>OneDrive</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string></string>
		<key>SELF_SERVICE_ICON</key>
		<string>Microsoft OneDrive.png</string>
		<key>SITE_ID</key>
		<string>1</string>
		<key>SITE_NAME</key>
		<string>CLA</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.apettinen.download.MSOneDrive</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>purge_destination</key>
				<true/>
				<key>flat_pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%filename%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/OneDrive.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/OneDrive.pkg.unpacked/</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/OneDrive.pkg.unpacked/OneDrive.app/Contents/Info.plist</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.kernsb.bkerns-recipes.recipe.IntVerProcessor/IntVerProcessor</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%filename%</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/Core-MicrosoftOneDriveBiz-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FileMover</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>extension_attributes</key>
				<array>
					<dict>
						<key>ext_attribute_path</key>
						<string>MicrosoftOneDriveBizCLAExtensionAttribute.xml</string>
					</dict>
				</array>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
                <key>scripts</key>
                <array>
                    <dict>
                        <key>name</key>
                        <string>Core-MicrosoftOneDrive-EnableBusiness</string>
                        <key>template_path</key>
                        <string>MicrosoftOneDriveBizScriptTemplate.xml</string>
                    </dict>
                </array>
				<key>os_requirements</key>
				<string>%OS_REQUIREMENTS%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/Core-MicrosoftOneDriveBiz-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
