<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads updates for Acrobat DC.
Set MAJOR_VERSION to "Acrobat2015" to download the 'Classic Track' updates for acrobat DC instead of the Continuous track.
	</string>
	<key>Identifier</key>
	<string>com.github.kernsb.bkerns-recipes.download.AdobeAcrobatDCWin</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Adobe Acrobat DC</string>
		<key>FILENAME</key>
		<string>AdobeAcrobatDC</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AdobeAcrobatDCWinInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%FILENAME%-%version%.msp</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
